## 🏗️ Terraform Plan - prod

```terraform
data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-2]
data.aws_caller_identity.current: Read complete after 0s [id=973030239074]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.nextjs_build[0] will be created
  + resource "aws_cloudfront_distribution" "nextjs_build" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "databro NextJS Distribution (prod)"
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + logging_v1_enabled              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Environment" = "prod"
          + "Name"        = "databro-cloudfront-prod"
          + "Owner"       = "Kumar Saraboji"
          + "Service"     = "Portfolio"
          + "Track"       = "Data Engineering"
        }
      + tags_all                        = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "databro-cloudfront-prod"
          + "Owner"       = "Kumar Saraboji"
          + "Project"     = "databro"
          + "Service"     = "Portfolio"
          + "Track"       = "Data Engineering"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + custom_error_response {
          + error_caching_min_ttl = 10
          + error_code            = 403
          + response_code         = 200
          + response_page_path    = "/index.html"
        }
      + custom_error_response {
          + error_caching_min_ttl = 10
          + error_code            = 404
          + response_code         = 200
          + response_page_path    = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "myS3Origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = (known after apply)
          + origin_id                   = "myS3Origin"
          + response_completion_timeout = (known after apply)
            # (2 unchanged attributes hidden)

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # aws_cloudfront_origin_access_identity.nextjs_build[0] will be created
  + resource "aws_cloudfront_origin_access_identity" "nextjs_build" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "OAI for databro NextJS build (prod)"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # aws_s3_bucket.logs[0] will be created
  + resource "aws_s3_bucket" "logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "databro-prod-build-logs-973030239074"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "prod"
          + "Name"        = "databro-logs-prod"
          + "Owner"       = "Kumar Saraboji"
          + "Service"     = "Portfolio"
          + "Track"       = "Data Engineering"
        }
      + tags_all                    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "databro-logs-prod"
          + "Owner"       = "Kumar Saraboji"
          + "Project"     = "databro"
          + "Service"     = "Portfolio"
          + "Track"       = "Data Engineering"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket.nextjs_build will be created
  + resource "aws_s3_bucket" "nextjs_build" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "databro-prod-build-973030239074"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "prod"
          + "Name"        = "databro-nextjs-build-prod"
          + "Owner"       = "Kumar Saraboji"
          + "Service"     = "Portfolio"
          + "Track"       = "Data Engineering"
        }
      + tags_all                    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "databro-nextjs-build-prod"
          + "Owner"       = "Kumar Saraboji"
          + "Project"     = "databro"
          + "Service"     = "Portfolio"
          + "Track"       = "Data Engineering"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_cors_configuration.nextjs_build will be created
  + resource "aws_s3_bucket_cors_configuration" "nextjs_build" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-2"

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "HEAD",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
            ]
            id              = null
          + max_age_seconds = 3000
        }
    }

  # aws_s3_bucket_lifecycle_configuration.logs[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "logs" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "us-east-2"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "delete-old-logs"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 90
              + expired_object_delete_marker = false
            }
        }
    }

  # aws_s3_bucket_logging.nextjs_build[0] will be created
  + resource "aws_s3_bucket_logging" "nextjs_build" {
      + bucket                = (known after apply)
      + expected_bucket_owner = "973030239074"
      + id                    = (known after apply)
      + region                = "us-east-2"
      + target_bucket         = (known after apply)
      + target_prefix         = "nextjs-build/"
    }

  # aws_s3_bucket_policy.nextjs_build[0] will be created
  + resource "aws_s3_bucket_policy" "nextjs_build" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-east-2"
    }

  # aws_s3_bucket_public_access_block.logs[0] will be created
  + resource "aws_s3_bucket_public_access_block" "logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "us-east-2"
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.nextjs_build will be created
  + resource "aws_s3_bucket_public_access_block" "nextjs_build" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "us-east-2"
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.logs[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-2"

      + rule {
          + blocked_encryption_types = []

          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.nextjs_build will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "nextjs_build" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-2"

      + rule {
          + blocked_encryption_types = []

          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.nextjs_build will be created
  + resource "aws_s3_bucket_versioning" "nextjs_build" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-2"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + all_buckets_info            = {
      + current_bucket = (known after apply)
      + current_env    = "prod"
      + dev_bucket     = "databro-dev-build-973030239074"
      + prod_bucket    = "databro-prod-build-973030239074"
    }
  + aws_account_id              = "973030239074"
  + aws_region                  = "us-east-2"
  + cloudfront_distribution_arn = (known after apply)
  + cloudfront_distribution_id  = (known after apply)
  + cloudfront_domain_name      = (known after apply)
  + deployment_instructions     = (known after apply)
  + dev_bucket_name             = "databro-dev-build-973030239074"
  + environment                 = "prod"
  + log_bucket_name             = (known after apply)
  + prod_bucket_name            = "databro-prod-build-973030239074"
  + s3_bucket_arn               = (known after apply)
  + s3_bucket_name              = (known after apply)
  + s3_bucket_region            = "us-east-2"
  + s3_regional_domain_name     = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

**Plan Status**: success
**Validation**: success
**Format**: success